In [1]:
import sqlite3

In [2]:
db_file = "movies.db"
conn = sqlite3.connect(db_file, timeout=10)
c = conn.cursor()

In [3]:
def execute_task(task, connection = conn):
    c = connection.cursor()
    return c.execute(task)

In [4]:
directors = execute_task("SELECT * FROM directors;")
movies = execute_task("SELECT * FROM movies;")
ratings = execute_task("SELECT * FROM ratings;")
people = execute_task("SELECT * FROM people;")
stars = execute_task("SELECT * FROM stars;")

In [5]:
try:
    c.execute('CREATE INDEX people_index ON people(id);')
    c.execute('CREATE INDEX person_index ON stars(person_id);')
    c.execute('CREATE INDEX movie_index ON stars(movie_id);')
    c.execute('CREATE INDEX name_index ON people(name);')
except Exception as e:
    print(e)

# 1.sql

## Q:  list the titles of all movies released in 2008

1. Your query should output a table with a single column for the title of each movie.

In [6]:
task = """
        SELECT title, year
        FROM movies
        WHERE year = 2008;
"""

sql_one = execute_task(task)
sql_one.fetchmany(10)

[('Biriken', 2008),
 ('Still Waters Burn', 2008),
 ('My Apocalypse', 2008),
 ('Beloved Clara', 2008),
 ('The Bank Job', 2008),
 ('Berlin Calling', 2008),
 ('This Child of Mine', 2008),
 ('Jackson', 2008),
 ('A Circle on the Cross', 2008),
 ('Brothel', 2008)]

# 2.sql

## Q: determine the birth year of Emma Stone

1. Your query should output a table with a single column and a single row (plus optional header) containing Emma Stone’s birth year.
2. You may assume that there is only one person in the database with the name Emma Stone.

In [7]:
task = """
        SELECT name, birth
        FROM people
        WHERE name = 'Emma Stone';
"""

sql_two = execute_task(task)
sql_two.fetchone()

('Emma Stone', 1988)

# 3.sql

## Q: list the titles of all movies with a release date on or after 2018, in alphabetical order.

1. Your query should output a table with a single column for the title of each movie.
2. Movies released in 2018 should be included, as should movies with release dates in the future.

In [8]:
task = """
        SELECT title, year
        FROM movies
        WHERE year >= 2018
        ORDER BY title ASC;
"""

sql_three = execute_task(task)
sql_three.fetchmany(10)

[('#19', 2021),
 ('#1915House', 2018),
 ('#5', 2018),
 ('#AbroHilo', 2019),
 ('#Alone', 2020),
 ('#AnneFrank. Parallel Stories', 2019),
 ('#Bicyclediary', 2018),
 ("#BigFertility: It's All About The Money", 2018),
 ('#Bornagain', 2018),
 ('#Expression', 2019)]

# 4.sql

## Q: determine the number of movies with an IMDb rating of 10.0

1. Your query should output a table with a single column and a single row (plus optional header) containing the number of movies with a 10.0 rating.

In [9]:
task = """
        SELECT COUNT(title) FROM movies
        INNER JOIN ratings
        ON movies.id = ratings.movie_id
        WHERE rating = 10.0;
"""

sql_four = execute_task(task)
sql_four.fetchone()

(12,)

# 5.sql

## Q: list the titles and release years of all Harry Potter movies, in chronological order

1. Your query should output a table with two columns, one for the title of each movie and one for the release year of each movie.
2. You may assume that the title of all Harry Potter movies will begin with the words “Harry Potter”, and that if a movie title begins with the words “Harry Potter”, it is a Harry Potter movie.

In [10]:
task = """
        SELECT * FROM movies
        WHERE title LIKE 'Harry Potter%'
        ORDER BY year ASC;
"""

sql_five = execute_task(task)
sql_five.fetchall()

[(241527, "Harry Potter and the Sorcerer's Stone", 2001),
 (295297, 'Harry Potter and the Chamber of Secrets', 2002),
 (304141, 'Harry Potter and the Prisoner of Azkaban', 2004),
 (330373, 'Harry Potter and the Goblet of Fire', 2005),
 (373889, 'Harry Potter and the Order of the Phoenix', 2007),
 (417741, 'Harry Potter and the Half-Blood Prince', 2009),
 (926084, 'Harry Potter and the Deathly Hallows: Part 1', 2010),
 (1201607, 'Harry Potter and the Deathly Hallows: Part 2', 2011),
 (8443702, 'Harry Potter and the Untold Stories of Hogwarts', 2012),
 (7783322, 'Harry Potter: A History of Magic', 2017)]

# 6.sql

## Q: determine the average rating of all movies released in 2012

1. Your query should output a table with a single column and a single row (plus optional header) containing the average rating.

In [11]:
task = """
        SELECT AVG(rating) FROM movies
        INNER JOIN ratings
        ON movies.id = ratings.movie_id
        WHERE year = 2012;
"""

sql_six = execute_task(task)
sql_six.fetchall()[0][0]

6.275459249676552

# 7.sql

## Q: list all movies released in 2010 and their ratings, in descending order by rating. For movies with the same rating, order them alphabetically by title

1. Your query should output a table with two columns, one for the title of each movie and one for the rating of each movie.
2. Movies that do not have ratings should not be included in the result.

In [12]:
task = """
        SELECT title, rating FROM movies
        INNER JOIN ratings
        ON movies.id = ratings.movie_id
        WHERE year = 2010
        ORDER BY rating DESC, title ASC;
"""

sql_seven = execute_task(task)
sql_seven.fetchmany(10)

[('Amaren ideia', 9.8),
 ('Mujeres republicanas', 9.8),
 ('Soberano: Seis Vezes São Paulo', 9.5),
 ('For Queen and Country', 9.4),
 ('Invisible Circus: No Dress Rehearsal', 9.4),
 ('Kino moje malo', 9.4),
 ('Land of the Rising Fastball', 9.4),
 ('Moonshine to the Finish Line: An Unofficial History of NASCAR', 9.4),
 ('Nickel City Smiler', 9.4),
 ('Bots High', 9.3)]

# 8.sql

## Q: list the names of all people who starred in Toy Story

1. Your query should output a table with a single column for the name of each person.
2. You may assume that there is only one movie in the database with the title Toy Story.

In [13]:
task = """
        SELECT name FROM movies
        INNER JOIN stars
        ON movies.id = stars.movie_id
        INNER JOIN people
        ON stars.person_id = people.id
        WHERE title = 'Toy Story';
"""

sql_eight = execute_task(task)
sql_eight.fetchall()

[('Tom Hanks',), ('Tim Allen',), ('Don Rickles',), ('Jim Varney',)]

# 9.sql

## Q: list the names of all people who starred in a movie released in 2004, ordered by birth year

1. Your query should output a table with a single column for the name of each person.
2. People with the same birth year may be listed in any order.
3. No need to worry about people who have no birth year listed, so long as those who do have a birth year are listed in order.
4. If a person appeared in more than one movie in 2004, they should only appear in your results once.

In [14]:
task = """
        SELECT 
            DISTINCT(person_id),
            name
        FROM stars
        
        JOIN people
            ON stars.person_id = people.id
        
        WHERE movie_id IN (
            SELECT id FROM movies
            WHERE year = 2004
        );
"""

sql_nine = execute_task(task)
print(len(sql_nine.fetchall()))
## sql_nine.fetchmany(10)

18013

# 10.sql

## Q: list the names of all people who have directed a movie that received a rating of at least 9.0

1. Your query should output a table with a single column for the name of each person.

In [15]:
task = """
        SELECT 
            DISTINCT(name)
        FROM directors

        LEFT OUTER JOIN ratings
            ON directors.movie_id = ratings.movie_id
        JOIN people
            ON directors.person_id = people.id

        WHERE rating >= 9.0;
"""

sql_ten = execute_task(task)
print(len(sql_ten.fetchall()))

1841

# 11.sql

## Q: list the titles of the five highest rated movies (in order) that Chadwick Boseman starred in, starting with the highest rated

1. Your query should output a table with a single column for the title of each movie.
2. You may assume that there is only one person in the database with the name Chadwick Boseman.

In [16]:
task = """
        SELECT 
            name,
            title,
            rating
        FROM movies

        JOIN stars
            ON movies.id = stars.movie_id
        JOIN people
            ON stars.person_id = people.id
        JOIN ratings
            ON movies.id = ratings.movie_id

        WHERE name = 'Chadwick Boseman'
        ORDER BY 
            rating DESC,
            title ASC
        LIMIT 5;
"""

sql_eleven = execute_task(task)
sql_eleven.fetchall()

[('Chadwick Boseman', '42', 7.5),
 ('Chadwick Boseman', 'Black Panther', 7.3),
 ('Chadwick Boseman', 'Marshall', 7.2),
 ('Chadwick Boseman', 'Get on Up', 6.9),
 ('Chadwick Boseman', 'Draft Day', 6.8)]

# 12.sql

## Q: list the titles of all movies in which both Johnny Depp and Helena Bonham Carter starred

1. Your query should output a table with a single column for the title of each movie.
2. You may assume that there is only one person in the database with the name Johnny Depp.
3. You may assume that there is only one person in the database with the name Helena Bonham Carter.

In [17]:
try:
    task = """
            CREATE VIEW jd_hbc AS

            SELECT 
                movie_id,
                person_id,
                title,
                name
            FROM movies

            JOIN stars
            ON movies.id = stars.movie_id
            JOIN people
            ON stars.person_id = people.id
            WHERE name = 'Johnny Depp' or name = 'Helena Bonham Carter'
    """
    sql_twelve = c.execute(task)
    conn.commit()
except Exception as e:
    print(e)

task_2 = """
        SELECT title FROM jd_hbc
        GROUP BY movie_id, title
        HAVING count(movie_id) = 2;
"""        

sql_twelve = c.execute(task_2)
sql_twelve.fetchall()

[('Corpse Bride',),
 ('Charlie and the Chocolate Factory',),
 ('Sweeney Todd: The Demon Barber of Fleet Street',),
 ('Alice in Wonderland',),
 ('Dark Shadows',),
 ('Alice Through the Looking Glass',)]

# 13.sql

## Q: list the names of all people who starred in a movie in which Kevin Bacon also starred

1. Your query should output a table with a single column for the name of each person.
2. There may be multiple people named Kevin Bacon in the database. Be sure to only select the Kevin Bacon born in 1958.
3. Kevin Bacon himself should not be included in the resulting list.

In [18]:
task = """
        SELECT 
            DISTINCT(name)
        FROM stars

        LEFT OUTER JOIN people
            ON stars.person_id = people.id
        WHERE movie_id IN(
        SELECT 
            movie_id
        FROM stars

        LEFT OUTER JOIN people
            ON stars.person_id = people.id
        WHERE name = 'Kevin Bacon'
            AND birth = 1958
        )
        AND name != 'Kevin Bacon';
"""        

sql_thirteen = c.execute(task)
print(len(sql_thirteen.fetchall()))

176